pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const FALCON_ERR_RANDOM: i32 = -1;
pub const FALCON_ERR_SIZE: i32 = -2;
pub const FALCON_ERR_FORMAT: i32 = -3;
pub const FALCON_ERR_BADSIG: i32 = -4;
pub const FALCON_ERR_BADARG: i32 = -5;
pub const FALCON_ERR_INTERNAL: i32 = -6;
pub const FALCON_SIG_COMPRESSED: u32 = 1;
pub const FALCON_SIG_PADDED: u32 = 2;
pub const FALCON_SIG_CT: u32 = 3;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__fsid_t), "::", stringify!(__val))
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shake256_context {
    pub opaque_contents: [u64; 26usize],
}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rpo128_context {
    pub opaque_contents: [u64; 13usize],
}

#[test]
fn bindgen_test_layout_shake256_context() {
    assert_eq!(
        ::std::mem::size_of::<shake256_context>(),
        208usize,
        concat!("Size of: ", stringify!(shake256_context))
    );
    assert_eq!(
        ::std::mem::align_of::<shake256_context>(),
        8usize,
        concat!("Alignment of ", stringify!(shake256_context))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<shake256_context>())).opaque_contents as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(shake256_context),
            "::",
            stringify!(opaque_contents)
        )
    );
}
#[test]
fn bindgen_test_layout_rpo128_context() {
    assert_eq!(
        ::std::mem::size_of::<rpo128_context>(),
        104usize,
        concat!("Size of: ", stringify!(rpo128_context))
    );
    assert_eq!(
        ::std::mem::align_of::<rpo128_context>(),
        8usize,
        concat!("Alignment of ", stringify!(rpo128_context))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rpo128_context>())).opaque_contents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpo128_context),
            "::",
            stringify!(opaque_contents)
        )
    );
}
extern "C" {
    pub fn shake256_init(sc: *mut shake256_context);
}
extern "C" {
    pub fn rpo128_init(sc: *mut rpo128_context);
}

extern "C" {
    pub fn shake256_inject(
        sc: *mut shake256_context,
        data: *const ::std::os::raw::c_void,
        len: size_t,
    );
}
extern "C" {
    pub fn rpo128_inject(sc: *mut rpo128_context, data: *const ::std::os::raw::c_void, len: size_t);
}

extern "C" {
    pub fn shake256_flip(sc: *mut shake256_context);
}
extern "C" {
    pub fn rpo128_flip(sc: *mut rpo128_context);
}

extern "C" {
    pub fn shake256_extract(
        sc: *mut shake256_context,
        out: *mut ::std::os::raw::c_void,
        len: size_t,
    );
}
extern "C" {
    pub fn rpo128_extract(sc: *mut rpo128_context, out: *mut ::std::os::raw::c_void, len: size_t);
}

extern "C" {
    pub fn shake256_init_prng_from_seed(
        sc: *mut shake256_context,
        seed: *const ::std::os::raw::c_void,
        seed_len: size_t,
    );
}
extern "C" {
    pub fn rpo128_init_prng_from_seed(
        sc: *mut rpo128_context,
        seed: *const ::std::os::raw::c_void,
        seed_len: size_t,
    );
}

extern "C" {
    pub fn shake256_init_prng_from_system(sc: *mut shake256_context) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rpo128_init_prng_from_system(sc: *mut rpo128_context) -> ::std::os::raw::c_int;
}

extern "C" {
    pub fn falcon_keygen_make(
        rng: *mut shake256_context,
        logn: ::std::os::raw::c_uint,
        privkey: *mut ::std::os::raw::c_void,
        privkey_len: size_t,
        pubkey: *mut ::std::os::raw::c_void,
        pubkey_len: size_t,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_make_public(
        pubkey: *mut ::std::os::raw::c_void,
        pubkey_len: size_t,
        privkey: *const ::std::os::raw::c_void,
        privkey_len: size_t,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_get_logn(obj: *mut ::std::os::raw::c_void, len: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_sign_dyn(
        rng: *mut shake256_context,
        sig: *mut ::std::os::raw::c_void,
        sig_len: *mut size_t,
        sig_type: ::std::os::raw::c_int,
        privkey: *const ::std::os::raw::c_void,
        privkey_len: size_t,
        data: *const ::std::os::raw::c_void,
        data_len: size_t,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_expand_privkey(
        expanded_key: *mut ::std::os::raw::c_void,
        expanded_key_len: size_t,
        privkey: *const ::std::os::raw::c_void,
        privkey_len: size_t,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_sign_tree(
        rng: *mut shake256_context,
        sig: *mut ::std::os::raw::c_void,
        sig_len: *mut size_t,
        sig_type: ::std::os::raw::c_int,
        expanded_key: *const ::std::os::raw::c_void,
        data: *const ::std::os::raw::c_void,
        data_len: size_t,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_sign_start(
        rng: *mut shake256_context,
        nonce: *mut ::std::os::raw::c_void,
        hash_data: *mut shake256_context,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_sign_dyn_finish(
        rng: *mut shake256_context,
        sig: *mut ::std::os::raw::c_void,
        sig_len: *mut size_t,
        sig_type: ::std::os::raw::c_int,
        privkey: *const ::std::os::raw::c_void,
        privkey_len: size_t,
        hash_data: *mut shake256_context,
        nonce: *const ::std::os::raw::c_void,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_sign_tree_finish(
        rng: *mut shake256_context,
        sig: *mut ::std::os::raw::c_void,
        sig_len: *mut size_t,
        sig_type: ::std::os::raw::c_int,
        expanded_key: *const ::std::os::raw::c_void,
        hash_data: *mut shake256_context,
        nonce: *const ::std::os::raw::c_void,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_verify(
        sig: *const ::std::os::raw::c_void,
        sig_len: size_t,
        sig_type: ::std::os::raw::c_int,
        pubkey: *const ::std::os::raw::c_void,
        pubkey_len: size_t,
        data: *const ::std::os::raw::c_void,
        data_len: size_t,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_verify_start(
        hash_data: *mut shake256_context,
        sig: *const ::std::os::raw::c_void,
        sig_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn falcon_verify_finish(
        sig: *const ::std::os::raw::c_void,
        sig_len: size_t,
        sig_type: ::std::os::raw::c_int,
        pubkey: *const ::std::os::raw::c_void,
        pubkey_len: size_t,
        hash_data: *mut shake256_context,
        tmp: *mut ::std::os::raw::c_void,
        tmp_len: size_t,
    ) -> ::std::os::raw::c_int;
}
